import os

from dotenv import load_dotenv
import random

load_dotenv()

BOT_TOKEN = str(os.getenv("BOT_TOKEN"))

link_chanell = "https://t.me/+Uitmcuho6lFmYTEy"
id_chanell = -1001839946036

progress = {
    'first': [1, 2_500_000]
}

referall = {'balance_user': ["Монеты", 1_000_000, 1_000_000_000],
            'balance_foken': ["Фокены", 10, 500]}

print()

progress_name = {
    'first': "Где я?"
}

admin_id = 1644643904

profit_cup = [1.5, 2.0, 2.5, 3.0, 3.5, 4]

profit = [0.25, 0.5, 1, 1.25, 1.5, 2]



price_stock = {
    1: 10_000,
    2: 100_000,
    3: 1_000_000,
    4: 5_000_000
}


darts_profit = {
    1: 0,
    2: 0.5,
    3: 1,
    4: 1.5,
    5: 2
}

bowl_profit = {
    1: 0,
    2: 0.2,
    3: 0.5,
    4: 1,
    5: 2,
    6: 3
}

football_profit = {
    1: 0,
    2: 0.5,
    3: 1,
    4: 1.5,
    5: 2
}

item_list = ["🧲", "🧲", "🧩", "🧩", "🎲", "🪙", "🔋", "🎁", "💰", "💸", "💎"]



item_profit = {
    "💎": 1.5,
    "💸": 1,
    "💰": 0.4,
    "🎁": 0.4,
    "🔋": 0.2,
    "🪙": 0.2,
    "🎲": 0,
    "🧩": 0,
    "🧲": 0
}

like = ["👍", "👍🏻", "👍🏼" "✅", ""]
right = ["правильно!", "вы угадали!", "победа!", "верно!", "точно!", "опять правильно!"]
wrong = ["не правильно", "не угадали", "проигрыш", "неверно", "неа", "упс..."]


info = ["❔","❗️", "❓", "❕"]
sad = ["😔", "😞", "😕", "😫", "😩", "😣", "☹️", "😒", ""]
joi = ["😁", "☺️", "😉", "😌", "😎", "👍", "🤑", ""]